In [1]:
%reload_ext sql

In [2]:
%sql postgresql://postgres:0000@localhost/postgres

In [21]:
%%sql
CREATE USER "12203353" WITH PASSWORD 'lol'

 * postgresql://postgres:***@localhost/postgres
(psycopg2.errors.DuplicateObject) role "12203353" already exists

[SQL: CREATE USER "12203353" WITH PASSWORD 'lol']
(Background on this error at: https://sqlalche.me/e/20/f405)

In [23]:
%sql postgresql://12203353:0000@localhost/postgres

In [4]:
%%sql
CREATE TABLE Professeur(
IdProfesseur integer primary key,
Nom varchar(100),
Prenom varchar(100));

CREATE TABLE Etudiant(
IdEtudiant integer primary key,
Nom varchar(100),
Prenom varchar(100),
Groupe varchar(100));

CREATE TABLE Matiere(
IdProfesseur integer,
IdMatiere varchar(100),
Matiere varchar(100),
primary key(IdProfesseur, IdMatiere),
foreign key (IdProfesseur) references Professeur(IdProfesseur));

CREATE TABLE Controle(
IdProfesseur integer,
IdEtudiant integer,
IdControle varchar(100),
IdMatiere varchar(100),
Nom varchar(100),
Note float,
primary key (IdProfesseur, IdEtudiant, IdControle, IdMatiere),
foreign key (IdProfesseur) references Professeur(IdProfesseur),
foreign key (IdEtudiant) references Etudiant(IdEtudiant));

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
Done.
Done.

[]

In [5]:
%%sql

INSERT INTO Professeur(IdProfesseur, Nom, Prenom) VALUES
(12213377, 'Saravanan', 'Bryan'),
(12202185, 'Soupramaniane', 'Vimal'),
(12207851, 'Abelard', 'Rodlens');

INSERT INTO Etudiant(IdEtudiant, Nom, Prenom, Groupe)
VALUES
(12213513, 'Rattinassababady', 'Bharani', 'Indra'),
(12203353, 'Galindo Garcia', 'Adrian', 'Indra'),
(12965358, 'Laurent', 'David', 'Zeus');

INSERT INTO Matiere(IdProfesseur, IdMatiere, Matiere )
VALUES (12213377, 'R1-01A', 'Initiation au développement A'),
(12213377, 'R1-01B', 'Initiation au développement B'),
(12202185, 'R1-02', 'Developpement interface web'),
(12202185, 'R1-03', 'Introduction architecture des ordinateur'),
(12213377, 'R1-04', 'Introduction au Systemes '),
(12213377, 'R1-05', 'Introduction aux bases de données et SQL'),
(12202185, 'R1-06', 'Mathématique discrète'),
(12202185, 'R1-07', 'Outils mathématique fondamentaux'),
(12207851, 'R1-08', 'Gestion de projet'),
(12207851, 'R1-09', 'Economie durable et numérique'),
(12213377, 'R1-10', 'Anglais technique'),
(12207851, 'R1-11', 'Bases de la communication'),
(12207851, 'R1-12', 'Projet professionel et personnel'),
(12213377, 'S1-01', 'Implémentation d un besoin client'),
(12202185, 'S1-02', 'Comparaison d approches algorithmique'),
(12202185, 'S1-03', 'Installation d un poste pour le developpement'),
(12213377, 'S1-04', 'Création d une base de données'),
(12207851, 'S1-05', 'Recueil de besoins'),
(12207851, 'S1-06', 'Découvert de l environnement économique et écologique');

INSERT INTO Controle(IdProfesseur, IdEtudiant, IdControle, IdMatiere,
Nom, Note) VALUES
(12202185, 12213513, 'R101A-1', 'R1-01A', 'Controle', 20),
(12202185, 12213513, 'R101B-2', 'R1-01B', 'Examen', 16),
(12213377, 12213513, 'R102-1', 'R1-02', 'Controle', 14),
(12213377, 12213513, 'R103-1', 'R1-03', 'Examen', 17),
(12202185, 12213513, 'R104-1', 'R1-04', 'Examen', 14),
(12202185, 12213513, 'R105-1', 'R1-05', 'Examen', 16),
(12213377, 12213513, 'R106-1', 'R1-06', 'Examen', 17),
(12213377, 12213513, 'R107-1', 'R1-07', 'Examen', 19),
(12207851, 12213513, 'R108-1', 'R1-08', 'Examen', 15),
(12207851, 12213513, 'R109-1', 'R1-09', 'Examen', 17),
(12202185, 12213513, 'R110-1', 'R1-10', 'Examen', 19),
(12207851, 12213513, 'R111-1', 'R1-11', 'Examen', 16),
(12207851, 12213513, 'R112-1', 'R1-12', 'Examen', 15),
(12202185, 12213513, 'S101-1', 'S1-01', 'SAE', 19),
(12213377, 12213513, 'S102-1', 'S1-02', 'SAE', 20),
(12213377, 12213513, 'S103-1', 'S1-03', 'SAE', 17),
(12202185, 12213513, 'S104-1', 'S1-04', 'SAE', 18),
(12207851, 12213513, 'S105-1', 'S1-05', 'SAE', 17),
(12207851, 12213513, 'S106-1', 'S1-06', 'SAE', 20),
(12202185, 12203353, 'R101A-1', 'R1-01A', 'Controle', 18),
(12202185, 12203353, 'R101B-2', 'R1-01B', 'Examen', 16),
(12213377, 12203353, 'R102-1', 'R1-02', 'Controle', 15),
(12213377, 12203353, 'R103-1', 'R1-03', 'Examen', 17),
(12202185, 12203353, 'R104-1', 'R1-04', 'Examen', 15),
(12202185, 12203353, 'R105-1', 'R1-05', 'Examen', 17),
(12213377, 12203353, 'R106-1', 'R1-06', 'Examen', 18),
(12213377, 12203353, 'R107-1', 'R1-07', 'Examen', 18),
(12207851, 12203353, 'R108-1', 'R1-08', 'Examen', 15),
(12207851, 12203353, 'R109-1', 'R1-09', 'Examen', 17),
(12202185, 12203353, 'R110-1', 'R1-10', 'Examen', 19),
(12207851, 12203353, 'R111-1', 'R1-11', 'Examen', 15),
(12207851, 12203353, 'R112-1', 'R1-12', 'Examen', 14),
(12202185, 12203353, 'S101-1', 'S1-01', 'SAE', 19),
(12213377, 12203353, 'S102-1', 'S1-02', 'SAE', 20),
(12213377, 12203353, 'S103-1', 'S1-03', 'SAE', 18),
(12202185, 12203353, 'S104-1', 'S1-04', 'SAE', 18),
(12207851, 12203353, 'S105-1', 'S1-05', 'SAE', 17),
(12207851, 12203353, 'S106-1', 'S1-06', 'SAE', 20),
(12202185, 12965358, 'S101-1', 'S1-01', 'SAE', 12),
(12213377, 12965358, 'S102-1', 'S1-02', 'SAE', 10),
(12213377, 12965358, 'S103-1', 'S1-03', 'SAE', 15),
(12202185, 12965358, 'S104-1', 'S1-04', 'SAE', 16),
(12207851, 12965358, 'S105-1', 'S1-05', 'SAE', 14),
(12207851, 12965358, 'S106-1', 'S1-06', 'SAE', 11);

 * postgresql://postgres:***@localhost/postgres
3 rows affected.
3 rows affected.
19 rows affected.
44 rows affected.

[]

In [6]:
%%sql
select idmatiere,matiere from matiere;

 * postgresql://postgres:***@localhost/postgres
19 rows affected.

[('R1-01A', 'Initiation au développement A'),
 ('R1-01B', 'Initiation au développement B'),
 ('R1-02', 'Developpement interface web'),
 ('R1-03', 'Introduction architecture des ordinateur'),
 ('R1-04', 'Introduction au Systemes '),
 ('R1-05', 'Introduction aux bases de données et SQL'),
 ('R1-06', 'Mathématique discrète'),
 ('R1-07', 'Outils mathématique fondamentaux'),
 ('R1-08', 'Gestion de projet'),
 ('R1-09', 'Economie durable et numérique'),
 ('R1-10', 'Anglais technique'),
 ('R1-11', 'Bases de la communication'),
 ('R1-12', 'Projet professionel et personnel'),
 ('S1-01', 'Implémentation d un besoin client'),
 ('S1-02', 'Comparaison d approches algorithmique'),
 ('S1-03', 'Installation d un poste pour le developpement'),
 ('S1-04', 'Création d une base de données'),
 ('S1-05', 'Recueil de besoins'),
 ('S1-06', 'Découvert de l environnement économique et écologique')]

In [7]:
%%sql
select * from professeur;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[(12213377, 'Saravanan', 'Bryan'),
 (12202185, 'Soupramaniane', 'Vimal'),
 (12207851, 'Abelard', 'Rodlens')]

In [8]:
%%sql
select * from etudiant;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[(12213513, 'Rattinassababady', 'Bharani', 'Indra'),
 (12203353, 'Galindo Garcia', 'Adrian', 'Indra'),
 (12965358, 'Laurent', 'David', 'Zeus')]

In [9]:
%%sql
select * from matiere;

 * postgresql://postgres:***@localhost/postgres
19 rows affected.

[(12213377, 'R1-01A', 'Initiation au développement A'),
 (12213377, 'R1-01B', 'Initiation au développement B'),
 (12202185, 'R1-02', 'Developpement interface web'),
 (12202185, 'R1-03', 'Introduction architecture des ordinateur'),
 (12213377, 'R1-04', 'Introduction au Systemes '),
 (12213377, 'R1-05', 'Introduction aux bases de données et SQL'),
 (12202185, 'R1-06', 'Mathématique discrète'),
 (12202185, 'R1-07', 'Outils mathématique fondamentaux'),
 (12207851, 'R1-08', 'Gestion de projet'),
 (12207851, 'R1-09', 'Economie durable et numérique'),
 (12213377, 'R1-10', 'Anglais technique'),
 (12207851, 'R1-11', 'Bases de la communication'),
 (12207851, 'R1-12', 'Projet professionel et personnel'),
 (12213377, 'S1-01', 'Implémentation d un besoin client'),
 (12202185, 'S1-02', 'Comparaison d approches algorithmique'),
 (12202185, 'S1-03', 'Installation d un poste pour le developpement'),
 (12213377, 'S1-04', 'Création d une base de données'),
 (12207851, 'S1-05', 'Recueil de besoins'),
 (12207851, 'S1-06', 'Découvert de l environnement économique et écologique')]

In [10]:
%%sql
select * from controle;

 * postgresql://postgres:***@localhost/postgres
44 rows affected.

[(12202185, 12213513, 'R101A-1', 'R1-01A', 'Controle', 20.0),
 (12202185, 12213513, 'R101B-2', 'R1-01B', 'Examen', 16.0),
 (12213377, 12213513, 'R102-1', 'R1-02', 'Controle', 14.0),
 (12213377, 12213513, 'R103-1', 'R1-03', 'Examen', 17.0),
 (12202185, 12213513, 'R104-1', 'R1-04', 'Examen', 14.0),
 (12202185, 12213513, 'R105-1', 'R1-05', 'Examen', 16.0),
 (12213377, 12213513, 'R106-1', 'R1-06', 'Examen', 17.0),
 (12213377, 12213513, 'R107-1', 'R1-07', 'Examen', 19.0),
 (12207851, 12213513, 'R108-1', 'R1-08', 'Examen', 15.0),
 (12207851, 12213513, 'R109-1', 'R1-09', 'Examen', 17.0),
 (12202185, 12213513, 'R110-1', 'R1-10', 'Examen', 19.0),
 (12207851, 12213513, 'R111-1', 'R1-11', 'Examen', 16.0),
 (12207851, 12213513, 'R112-1', 'R1-12', 'Examen', 15.0),
 (12202185, 12213513, 'S101-1', 'S1-01', 'SAE', 19.0),
 (12213377, 12213513, 'S102-1', 'S1-02', 'SAE', 20.0),
 (12213377, 12213513, 'S103-1', 'S1-03', 'SAE', 17.0),
 (12202185, 12213513, 'S104-1', 'S1-04', 'SAE', 18.0),
 (12207851, 12213513, 'S105-1', 'S1-05', 'SAE', 17.0),
 (12207851, 12213513, 'S106-1', 'S1-06', 'SAE', 20.0),
 (12202185, 12203353, 'R101A-1', 'R1-01A', 'Controle', 18.0),
 (12202185, 12203353, 'R101B-2', 'R1-01B', 'Examen', 16.0),
 (12213377, 12203353, 'R102-1', 'R1-02', 'Controle', 15.0),
 (12213377, 12203353, 'R103-1', 'R1-03', 'Examen', 17.0),
 (12202185, 12203353, 'R104-1', 'R1-04', 'Examen', 15.0),
 (12202185, 12203353, 'R105-1', 'R1-05', 'Examen', 17.0),
 (12213377, 12203353, 'R106-1', 'R1-06', 'Examen', 18.0),
 (12213377, 12203353, 'R107-1', 'R1-07', 'Examen', 18.0),
 (12207851, 12203353, 'R108-1', 'R1-08', 'Examen', 15.0),
 (12207851, 12203353, 'R109-1', 'R1-09', 'Examen', 17.0),
 (12202185, 12203353, 'R110-1', 'R1-10', 'Examen', 19.0),
 (12207851, 12203353, 'R111-1', 'R1-11', 'Examen', 15.0),
 (12207851, 12203353, 'R112-1', 'R1-12', 'Examen', 14.0),
 (12202185, 12203353, 'S101-1', 'S1-01', 'SAE', 19.0),
 (12213377, 12203353, 'S102-1', 'S1-02', 'SAE', 20.0),
 (12213377, 12203353, 'S103-1', 'S1-03', 'SAE', 18.0),
 (12202185, 12203353, 'S104-1', 'S1-04', 'SAE', 18.0),
 (12207851, 12203353, 'S105-1', 'S1-05', 'SAE', 17.0),
 (12207851, 12203353, 'S106-1', 'S1-06', 'SAE', 20.0),
 (12202185, 12965358, 'S101-1', 'S1-01', 'SAE', 12.0),
 (12213377, 12965358, 'S102-1', 'S1-02', 'SAE', 10.0),
 (12213377, 12965358, 'S103-1', 'S1-03', 'SAE', 15.0),
 (12202185, 12965358, 'S104-1', 'S1-04', 'SAE', 16.0),
 (12207851, 12965358, 'S105-1', 'S1-05', 'SAE', 14.0),
 (12207851, 12965358, 'S106-1', 'S1-06', 'SAE', 11.0)]

In [4]:
%%sql
CREATE OR REPLACE FUNCTION Releve_Etudiant(in id int, out Nom varchar, out
Groupe varchar, out Prenom varchar,out IdControle varchar,out IdMatiere
varchar,out Nom_Controle varchar,out Note float) RETURNS SETOF record AS
$$
Select Etudiant.Nom, Prenom, Groupe, IdControle,idMatiere, Controle.nom,
Note
From Controle join Etudiant on Controle.IdEtudiant = Etudiant.IdEtudiant
Where Controle.IdEtudiant=$1
Order by IdControle;
$$language SQL;

 * postgresql://postgres:***@localhost/postgres
(psycopg2.errors.SyntaxError) syntax error at or near "Where"
LINE 1: Where Controle.IdEtudiant=1$language SQL;
        ^

[SQL: Where Controle.IdEtudiant=1$language SQL;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [11]:
%%sql
select * from Releve_Etudiant(12203353);

 * postgresql://postgres:***@localhost/postgres
19 rows affected.

[('Galindo Garcia', 'Adrian', 'Indra', 'R101A-1', 'R1-01A', 'Controle', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R101B-2', 'R1-01B', 'Examen', 16.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R102-1', 'R1-02', 'Controle', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R103-1', 'R1-03', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R104-1', 'R1-04', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R105-1', 'R1-05', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R106-1', 'R1-06', 'Examen', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R107-1', 'R1-07', 'Examen', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R108-1', 'R1-08', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R109-1', 'R1-09', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R110-1', 'R1-10', 'Examen', 19.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R111-1', 'R1-11', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R112-1', 'R1-12', 'Examen', 14.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S101-1', 'S1-01', 'SAE', 19.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S102-1', 'S1-02', 'SAE', 20.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S103-1', 'S1-03', 'SAE', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S104-1', 'S1-04', 'SAE', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S105-1', 'S1-05', 'SAE', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S106-1', 'S1-06', 'SAE', 20.0)]

In [7]:
%%sql
CREATE OR REPLACE FUNCTION Releve_Groupe(in Groupe varchar, out Nom
varchar, out Prenom varchar,out Groupe varchar, out IdControle
varchar,out IdMatiere varchar,out Nom_Controle varchar,out Note float)
RETURNS SETOF record AS
$$
Select Etudiant.Nom, Prenom, Groupe, IdControle,idMatiere,
Controle.nom,Note
From Controle join Etudiant on Controle.idEtudiant =
Etudiant.idEtudiant
Where Etudiant.Groupe=$1
Order by Etudiant.Nom,Prenom,IdControle
$$language SQL;

 * postgresql://postgres:***@localhost/postgres
(psycopg2.errors.SyntaxError) syntax error at or near "Where"
LINE 1: Where Etudiant.Groupe=1$language SQL;
        ^

[SQL: Where Etudiant.Groupe=1$language SQL;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [12]:
%%sql
select * from Releve_Groupe('Indra');

 * postgresql://postgres:***@localhost/postgres
38 rows affected.

[('Galindo Garcia', 'Adrian', 'Indra', 'R101A-1', 'R1-01A', 'Controle', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R101B-2', 'R1-01B', 'Examen', 16.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R102-1', 'R1-02', 'Controle', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R103-1', 'R1-03', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R104-1', 'R1-04', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R105-1', 'R1-05', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R106-1', 'R1-06', 'Examen', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R107-1', 'R1-07', 'Examen', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R108-1', 'R1-08', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R109-1', 'R1-09', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R110-1', 'R1-10', 'Examen', 19.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R111-1', 'R1-11', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R112-1', 'R1-12', 'Examen', 14.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S101-1', 'S1-01', 'SAE', 19.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S102-1', 'S1-02', 'SAE', 20.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S103-1', 'S1-03', 'SAE', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S104-1', 'S1-04', 'SAE', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S105-1', 'S1-05', 'SAE', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S106-1', 'S1-06', 'SAE', 20.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R101A-1', 'R1-01A', 'Controle', 20.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R101B-2', 'R1-01B', 'Examen', 16.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R102-1', 'R1-02', 'Controle', 14.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R103-1', 'R1-03', 'Examen', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R104-1', 'R1-04', 'Examen', 14.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R105-1', 'R1-05', 'Examen', 16.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R106-1', 'R1-06', 'Examen', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R107-1', 'R1-07', 'Examen', 19.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R108-1', 'R1-08', 'Examen', 15.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R109-1', 'R1-09', 'Examen', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R110-1', 'R1-10', 'Examen', 19.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R111-1', 'R1-11', 'Examen', 16.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R112-1', 'R1-12', 'Examen', 15.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S101-1', 'S1-01', 'SAE', 19.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S102-1', 'S1-02', 'SAE', 20.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S103-1', 'S1-03', 'SAE', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S104-1', 'S1-04', 'SAE', 18.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S105-1', 'S1-05', 'SAE', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S106-1', 'S1-06', 'SAE', 20.0)]

In [33]:
%%sql
CREATE OR REPLACE FUNCTION Releve(out Nom varchar, out Prenom
varchar,out Groupe varchar, out IdControle varchar,out IdMatiere
varchar,out Nom_Controle varchar,out Note float) RETURNS SETOF record AS
$$
Select Etudiant.Nom, Prenom, Groupe, IdControle,idMatiere,
Controle.nom,Note
From Controle join Etudiant on Controle.idEtudiant =
Etudiant.idEtudiant
Order by Groupe,Etudiant.Nom,Prenom,IdControle
$$language SQL;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [13]:
%%sql
select * from Releve();

 * postgresql://postgres:***@localhost/postgres
44 rows affected.

[('Galindo Garcia', 'Adrian', 'Indra', 'R101A-1', 'R1-01A', 'Controle', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R101B-2', 'R1-01B', 'Examen', 16.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R102-1', 'R1-02', 'Controle', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R103-1', 'R1-03', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R104-1', 'R1-04', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R105-1', 'R1-05', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R106-1', 'R1-06', 'Examen', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R107-1', 'R1-07', 'Examen', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R108-1', 'R1-08', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R109-1', 'R1-09', 'Examen', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R110-1', 'R1-10', 'Examen', 19.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R111-1', 'R1-11', 'Examen', 15.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'R112-1', 'R1-12', 'Examen', 14.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S101-1', 'S1-01', 'SAE', 19.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S102-1', 'S1-02', 'SAE', 20.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S103-1', 'S1-03', 'SAE', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S104-1', 'S1-04', 'SAE', 18.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S105-1', 'S1-05', 'SAE', 17.0),
 ('Galindo Garcia', 'Adrian', 'Indra', 'S106-1', 'S1-06', 'SAE', 20.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R101A-1', 'R1-01A', 'Controle', 20.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R101B-2', 'R1-01B', 'Examen', 16.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R102-1', 'R1-02', 'Controle', 14.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R103-1', 'R1-03', 'Examen', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R104-1', 'R1-04', 'Examen', 14.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R105-1', 'R1-05', 'Examen', 16.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R106-1', 'R1-06', 'Examen', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R107-1', 'R1-07', 'Examen', 19.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R108-1', 'R1-08', 'Examen', 15.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R109-1', 'R1-09', 'Examen', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R110-1', 'R1-10', 'Examen', 19.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R111-1', 'R1-11', 'Examen', 16.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'R112-1', 'R1-12', 'Examen', 15.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S101-1', 'S1-01', 'SAE', 19.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S102-1', 'S1-02', 'SAE', 20.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S103-1', 'S1-03', 'SAE', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S104-1', 'S1-04', 'SAE', 18.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S105-1', 'S1-05', 'SAE', 17.0),
 ('Rattinassababady', 'Bharani', 'Indra', 'S106-1', 'S1-06', 'SAE', 20.0),
 ('Laurent', 'David', 'Zeus', 'S101-1', 'S1-01', 'SAE', 12.0),
 ('Laurent', 'David', 'Zeus', 'S102-1', 'S1-02', 'SAE', 10.0),
 ('Laurent', 'David', 'Zeus', 'S103-1', 'S1-03', 'SAE', 15.0),
 ('Laurent', 'David', 'Zeus', 'S104-1', 'S1-04', 'SAE', 16.0),
 ('Laurent', 'David', 'Zeus', 'S105-1', 'S1-05', 'SAE', 14.0),
 ('Laurent', 'David', 'Zeus', 'S106-1', 'S1-06', 'SAE', 11.0)]

In [4]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_Etudiant (in id int, out IDetudiant
int, out Moyenne float, out idMatiere varchar) RETURNS SETOF RECORD AS
$$ Select idetudiant, avg(note), idmatiere from controle where
controle.idetudiant = $1 group by idmatiere,idetudiant;
$$ language sql;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [14]:
%%sql
select * from Moyenne_Etudiant('12213513');

 * postgresql://postgres:***@localhost/postgres
19 rows affected.

[(12213513, 20.0, 'R1-01A'),
 (12213513, 16.0, 'R1-01B'),
 (12213513, 14.0, 'R1-02'),
 (12213513, 17.0, 'R1-03'),
 (12213513, 14.0, 'R1-04'),
 (12213513, 16.0, 'R1-05'),
 (12213513, 17.0, 'R1-06'),
 (12213513, 19.0, 'R1-07'),
 (12213513, 15.0, 'R1-08'),
 (12213513, 17.0, 'R1-09'),
 (12213513, 19.0, 'R1-10'),
 (12213513, 16.0, 'R1-11'),
 (12213513, 15.0, 'R1-12'),
 (12213513, 19.0, 'S1-01'),
 (12213513, 20.0, 'S1-02'),
 (12213513, 17.0, 'S1-03'),
 (12213513, 18.0, 'S1-04'),
 (12213513, 17.0, 'S1-05'),
 (12213513, 20.0, 'S1-06')]

In [14]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_Groupe (in groupe varchar, out Groupe
varchar, out Moyenne float, out idMatiere varchar) RETURNS SETOF RECORD AS
$$ 
Select groupe, avg(note), idmatiere from controle left outer join etudiant on Controle.idEtudiant = Etudiant.idetudiant where 
etudiant.groupe = $1 group by idmatiere,groupe;
$$ language sql;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [15]:
%%sql
Select * from Moyenne_Groupe('Indra');

 * postgresql://postgres:***@localhost/postgres
19 rows affected.

[('Indra', 19.0, 'R1-01A'),
 ('Indra', 16.0, 'R1-01B'),
 ('Indra', 14.5, 'R1-02'),
 ('Indra', 17.0, 'R1-03'),
 ('Indra', 14.5, 'R1-04'),
 ('Indra', 16.5, 'R1-05'),
 ('Indra', 17.5, 'R1-06'),
 ('Indra', 18.5, 'R1-07'),
 ('Indra', 15.0, 'R1-08'),
 ('Indra', 17.0, 'R1-09'),
 ('Indra', 19.0, 'R1-10'),
 ('Indra', 15.5, 'R1-11'),
 ('Indra', 14.5, 'R1-12'),
 ('Indra', 19.0, 'S1-01'),
 ('Indra', 20.0, 'S1-02'),
 ('Indra', 17.5, 'S1-03'),
 ('Indra', 18.0, 'S1-04'),
 ('Indra', 17.0, 'S1-05'),
 ('Indra', 20.0, 'S1-06')]

In [20]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_General (out Moyenne float, out
idMatiere varchar) RETURNS SETOF RECORD AS
$$ Select avg(note), idmatiere from controle group by idmatiere;
$$ language sql;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [17]:
%%sql
Select * from Moyenne_General();

 * postgresql://postgres:***@localhost/postgres
19 rows affected.

[(17.5, 'R1-06'),
 (17.0, 'R1-09'),
 (17.0, 'R1-03'),
 (18.5, 'R1-07'),
 (16.666666666666668, 'S1-01'),
 (19.0, 'R1-01A'),
 (14.5, 'R1-02'),
 (15.0, 'R1-08'),
 (14.5, 'R1-04'),
 (16.5, 'R1-05'),
 (17.333333333333332, 'S1-04'),
 (16.0, 'S1-05'),
 (16.0, 'R1-01B'),
 (14.5, 'R1-12'),
 (16.666666666666668, 'S1-03'),
 (16.666666666666668, 'S1-02'),
 (17.0, 'S1-06'),
 (19.0, 'R1-10'),
 (15.5, 'R1-11')]

In [24]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_Matiere (in id varchar, out Moyenne
float, out idMatiere varchar) RETURNS SETOF RECORD AS
$$ Select avg(note), IdMatiere from controle where controle.idmatiere=$1
group by IdMatiere;
$$ language sql;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [18]:
%%sql
Select * from Moyenne_Matiere('R1-04');

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(14.5, 'R1-04')]

In [26]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_Matiere_Groupe (in id varchar, in
groupe varchar, out Groupe varchar, out Moyenne float, out idMatiere
varchar) RETURNS SETOF RECORD AS
$$ Select groupe, avg(note), IdMatiere from controle cross join
etudiant
where controle.idmatiere=$1 and etudiant.groupe=$2
group by IdMatiere,groupe;
$$ language sql;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [19]:
%%sql
Select * from Moyenne_Matiere_Groupe('R1-07','Indra');

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[('Indra', 18.5, 'R1-07')]

In [20]:
%%sql
create user "12213377" WITH PASSWORD '0000';
create user "12202185" WITH PASSWORD '0000';
create user "12207851" WITH PASSWORD '0000';
create user "12213513" WITH PASSWORD '0000';
create user "12203353" WITH PASSWORD '0000';
create user "12965358" WITH PASSWORD '0000';
create user ADMIN_VILLETANEUSE WITH PASSWORD '0000';

CREATE GROUP role_professeur WITH USER "12213377","12202185","12207851";
CREATE GROUP role_etudiant WITH USER "12213513", "12203353","12965358";
GRANT select ON professeur to role_professeur;
GRANT select ON etudiant to role_professeur;
GRANT select, update, insert ON matiere TO role_professeur;
GRANT select, update, insert ON controle TO role_professeur;
GRANT select ON matiere to role_etudiant;
GRANT select ON controle to role_etudiant;
GRANT all privileges on professeur TO ADMIN_VILLETANEUSE;
GRANT all privileges on etudiant TO ADMIN_VILLETANEUSE;
GRANT all privileges on matiere TO ADMIN_VILLETANEUSE;
GRANT all privileges on controle TO ADMIN_VILLETANEUSE;

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [44]:
%%sql
CREATE or REPLACE FUNCTION Changer_Note(in Note float, in idEt int, in
IdMat varchar, in NomControle varchar) RETURNS float AS
$$
UPDATE controle SET Note=$1
WHERE $2 = Controle.IdEtudiant and
Controle.IdProfesseur ::varchar(15) = session_user and
Controle.IdControle = $3 and
Controle.Nom = $4 RETURNING Note;
$$language sql SECURITY DEFINER;

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [48]:
%%sql
CREATE or REPLACE FUNCTION MesResultats(out Matiere varchar, out
Controle varchar, out Nom_Controle varchar, out Note float) RETURNS
SETOF record AS
$$
Select Matiere, IdControle, Nom, Note
FROM Matiere natural join Controle
WHERE Controle.IdEtudiant ::varchar(15) = session_user;
$$language SQL SECURITY DEFINER

 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [24]:
%%sql
Select * from MesResultats();

 * postgresql://12203353:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
(psycopg2.errors.UndefinedFunction) function mesresultats() does not exist
LINE 1: Select * from MesResultats();
                      ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: Select * from MesResultats();]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [25]:
%%sql
CREATE OR REPLACE FUNCTION Competence1(out moyenne float, out matiere varchar,out coef int) RETURNS SETOF record AS
$$
Select moyenne,idmatiere,21 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-01A' UNION ALL
Select moyenne,idmatiere,21 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-01B' UNION ALL
Select moyenne,idmatiere,12 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-02' UNION ALL
Select moyenne,idmatiere,6 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-10' UNION ALL
Select moyenne,idmatiere,40 from Moyenne_Etudiant(session_user::int) where idMatiere='S1-01';
$$language sql SECURITY DEFINER

 * postgresql://12203353:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
(psycopg2.errors.SyntaxError) syntax error at or near "$"
LINE 1: $language sql SECURITY DEFINER
        ^

[SQL: $language sql SECURITY DEFINER]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [64]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_UE11() RETURNS SETOF float AS
$$
Select sum(moyenne*Coef)/sum(Coef) as moyenne_competence1 from Competence1() as Moyenne;
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [72]:
%%sql
select * from competence1();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
5 rows affected.

[(20.0, 'R1-01A', 21),
 (16.0, 'R1-01B', 21),
 (14.0, 'R1-02', 12),
 (19.0, 'R1-10', 6),
 (19.0, 'S1-01', 40)]

In [71]:
%%sql
Select * from Moyenne_UE11()

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(17.98,)]

In [74]:
%%sql
CREATE OR REPLACE FUNCTION Competence2(out moyenne float, out matiere varchar,out coef int) RETURNS SETOF record AS
$$
Select moyenne,idmatiere,12 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-01A' UNION ALL
Select moyenne,idmatiere,12 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-01B' UNION ALL
Select moyenne,idmatiere,3 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-03' UNION ALL
Select moyenne,idmatiere,3 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-04' UNION ALL
Select moyenne,idmatiere,15 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-06' UNION ALL
Select moyenne,idmatiere,15 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-07' UNION ALL
Select moyenne,idmatiere,40 from Moyenne_Etudiant(session_user::int) where idMatiere='S1-02';
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [75]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_UE12() RETURNS SETOF float AS
$$
Select sum(moyenne*Coef)/sum(Coef) as moyenne_competence2 from Competence2() as Moyenne;
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [79]:
%%sql
select * from competence2();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
7 rows affected.

[(20.0, 'R1-01A', 12),
 (16.0, 'R1-01B', 12),
 (17.0, 'R1-03', 3),
 (14.0, 'R1-04', 3),
 (17.0, 'R1-06', 15),
 (19.0, 'R1-07', 15),
 (20.0, 'S1-02', 40)]

In [80]:
%%sql
Select * from Moyenne_UE12()

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(18.65,)]

In [82]:
%%sql
CREATE OR REPLACE FUNCTION Competence3(out moyenne float, out matiere varchar,out coef int) RETURNS SETOF record AS
$$
Select moyenne,idmatiere,21 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-03' UNION ALL
Select moyenne,idmatiere,21 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-04' UNION ALL
Select moyenne,idmatiere,12 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-10' UNION ALL
Select moyenne,idmatiere,6 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-11' UNION ALL
Select moyenne,idmatiere,40 from Moyenne_Etudiant(session_user::int) where idMatiere='S1-03';
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [83]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_UE13() RETURNS SETOF float AS
$$
Select sum(moyenne*Coef)/sum(Coef) as moyenne_competence3 from Competence3() as Moyenne;
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [114]:
%%sql
select * from competence3();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
5 rows affected.

[(17.0, 'R1-03', 21),
 (14.0, 'R1-04', 21),
 (19.0, 'R1-10', 12),
 (16.0, 'R1-11', 6),
 (17.0, 'S1-03', 40)]

In [88]:
%%sql
Select * from Moyenne_UE13()

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(16.55,)]

In [84]:
%%sql
CREATE OR REPLACE FUNCTION Competence4(out moyenne float, out matiere varchar,out coef int) RETURNS SETOF record AS
$$
Select moyenne,idmatiere,36 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-05' UNION ALL
Select moyenne,idmatiere,18 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-06' UNION ALL
Select moyenne,idmatiere,6 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-09' UNION ALL
Select moyenne,idmatiere,40 from Moyenne_Etudiant(session_user::int) where idMatiere='S1-04';
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [85]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_UE14() RETURNS SETOF float AS
$$
Select sum(moyenne*Coef)/sum(Coef) as moyenne_competence4 from Competence4() as Moyenne;
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [89]:
%%sql
select * from competence4();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
4 rows affected.

[(16.0, 'R1-05', 36),
 (17.0, 'R1-06', 18),
 (17.0, 'R1-09', 6),
 (18.0, 'S1-04', 40)]

In [90]:
%%sql
Select * from Moyenne_UE14()

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(17.04,)]

In [93]:
%%sql
CREATE OR REPLACE FUNCTION Competence5(out moyenne float, out matiere varchar,out coef int) RETURNS SETOF record AS
$$
Select moyenne,idmatiere,18 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-02' UNION ALL
Select moyenne,idmatiere,27 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-08' UNION ALL
Select moyenne,idmatiere,15 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-11' UNION ALL
Select moyenne,idmatiere,40 from Moyenne_Etudiant(session_user::int) where idMatiere='S1-05';
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [94]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_UE15() RETURNS SETOF float AS
$$
Select sum(moyenne*Coef)/sum(Coef) as moyenne_competence5 from Competence5() as Moyenne;
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [98]:
%%sql
select * from competence5();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
4 rows affected.

[(14.0, 'R1-02', 18),
 (15.0, 'R1-08', 27),
 (16.0, 'R1-11', 15),
 (17.0, 'S1-05', 40)]

In [99]:
%%sql
Select * from Moyenne_UE15()

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(15.77,)]

In [95]:
%%sql
CREATE OR REPLACE FUNCTION Competence6(out moyenne float, out matiere varchar,out coef int) RETURNS SETOF record AS
$$
Select moyenne,idmatiere,5 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-02' UNION ALL
Select moyenne,idmatiere,11 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-08' UNION ALL
Select moyenne,idmatiere,11 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-09' UNION ALL
Select moyenne,idmatiere,11 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-10' UNION ALL
Select moyenne,idmatiere,11 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-11' UNION ALL
Select moyenne,idmatiere,11 from Moyenne_Etudiant(session_user::int) where idMatiere='R1-12' UNION ALL
Select moyenne,idmatiere,40 from Moyenne_Etudiant(session_user::int) where idMatiere='S1-06';
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [96]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_UE16() RETURNS SETOF float AS
$$
Select sum(moyenne*Coef)/sum(Coef) as moyenne_competence6 from Competence6() as Moyenne;
$$language sql SECURITY DEFINER

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [100]:
%%sql
select * from competence6();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
7 rows affected.

[(14.0, 'R1-02', 5),
 (15.0, 'R1-08', 11),
 (17.0, 'R1-09', 11),
 (19.0, 'R1-10', 11),
 (16.0, 'R1-11', 11),
 (15.0, 'R1-12', 11),
 (20.0, 'S1-06', 40)]

In [101]:
%%sql
Select * from Moyenne_UE16()

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(17.72,)]

In [119]:
%%sql
create view semestre1 as
Select * from Moyenne_UE11() UNION ALL
Select * from Moyenne_UE12() UNION ALL
Select * from Moyenne_UE13() UNION ALL
Select * from Moyenne_UE14() UNION ALL
Select * from Moyenne_UE15() UNION ALL
Select * from Moyenne_UE16();

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [125]:
%%sql
grant select on semestre1 to public;

   postgresql://12102347:***@localhost/postgres
 * postgresql://postgres:***@localhost/postgres
Done.

[]

In [127]:
%%sql
select * from semestre1;

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
6 rows affected.

[(17.98,), (18.65,), (16.55,), (17.04,), (15.77,), (17.72,)]

In [144]:
%%sql
CREATE or REPLACE FUNCTION Moyenne_semestre1() RETURNS float AS
$$
Select avg(moyenne_ue11) as moyenne_semestre1 from semestre1;
$$language sql

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
Done.

[]

In [143]:
%%sql
select * from Moyenne_semestre1();

 * postgresql://12102347:***@localhost/postgres
   postgresql://postgres:***@localhost/postgres
1 rows affected.

[(17.285,)]